// Жанры
export const MOVIE_GENRES = [
    "Все", "Боевик", "Приключения", "Анимация", "Комедия", "Криминал",
    "Документальный", "Драма", "Семейный", "Фэнтези", "Ужасы",
    "Детектив", "Мелодрама", "Научная фантастика", "Триллер", "Военный", "Вестерн"
];

export const BOOK_GENRES = [
    "Все", "Фантастика", "Фэнтези", "Детектив", "Роман", "Приключения",
    "Классика", "Научная фантастика", "Ужасы", "Поэзия", "Биография",
    "Исторический", "Драма", "Дистопия", "Триллер", "Нон-фикшн", "Философия"
];

export const TVSHOW_GENRES = [
    "Все", "Боевик", "Приключения", "Анимация", "Комедия", "Криминал",
    "Документальный", "Драма", "Семейный", "Фэнтези", "Ужасы",
    "Детектив", "Мелодрама", "Научная фантастика", "Триллер", "Военный", "Вестерн"
];